
* Reference:

 - Github:

https://github.com/stuarthalloway/presentations/wiki/Debugging-with-the-Scientific-Method

 - Talk

https://www.youtube.com/watch?v=FihU5JxmnBg



#+BEGIN_SRC sh :results value verbatim  :exports results

echo 'digraph finite_state_machine {
        FAILURE     -> HIPOTHESIS   [ label = "why"   ]
        HIPOTHESIS  -> EXPERIMENT   [ label = "suggests"]
	EXPERIMENT  -> OBSERVATION  [ label = "produces"]
        OBSERVATION -> HIPOTHESIS   [ label = "falsified?"]
        OBSERVATION -> THEORY       [ label = "?"]
        OBSERVATION -> HIPOTHESIS   [ label = "needs refinement"]
        OBSERVATION -> FAILURE      [ label = "something is wrong"]
}' | graph-easy
#+END_SRC

#+RESULTS:
#+begin_example
               +------------+  something is wrong
               |  FAILURE   | <-----------------------+
               +------------+                         |
                 |                                    |
                 | why                                |
                 v                                    |
               +------------+                         |
  +----------> | HIPOTHESIS | <+                      |
  |            +------------+  |                      |
  |              |             |                      |
  |              | suggests    |                      |
  |              v             |                      |
  |            +------------+  | needs refinement     |
  | falsified? | EXPERIMENT |  |                      |
  |            +------------+  |                      |
  |              |             |                      |
  |              | produces    |                      |
  |              v             |                      |
  |            +----------------------------------------+
  +----------- |              OBSERVATION               |
               +----------------------------------------+
                 |
                 | ?
                 v
               +------------+
               |   THEORY   |
               +------------+
#+end_example


